#Использовать asserts
#Использовать ".."

Функция ПолучитьСписокТестов(Тестирование) Экспорт
	
	СписокТестов = Новый Массив;
	СписокТестов.Добавить("НетФайлаСПараметрами");
	СписокТестов.Добавить("НетДонора");
	СписокТестов.Добавить("ДолженОбработатьКоммиты");

	Возврат СписокТестов;
КонецФункции

Процедура ПередЗапускомТеста()  Экспорт
КонецПроцедуры

Процедура ПослеЗапускаТеста()  Экспорт
КонецПроцедуры

Процедура НетФайлаСПараметрами()  Экспорт
	ВызватьИсключение "Не реализовано!";
КонецПроцедуры

Процедура НетДонора()  Экспорт
	ВызватьИсключение "Не реализовано!";
КонецПроцедуры

Процедура ДолженОбработатьКоммиты()  Экспорт
	ВызватьИсключение "Не реализовано!";
КонецПроцедуры