#Использовать asserts
#Использовать ".."

Функция ПолучитьСписокТестов(Тестирование) Экспорт
	
	СписокТестов = Новый Массив;
	СписокТестов.Добавить("Клонирование");
	СписокТестов.Добавить("ЗаписьВJSON");

	Возврат СписокТестов;
КонецФункции

Процедура ПередЗапускомТеста()  Экспорт
КонецПроцедуры

Процедура ПослеЗапускаТеста()  Экспорт
КонецПроцедуры

Процедура Клонирование()  Экспорт
	ВызватьИсключение "Не реализовано!";
КонецПроцедуры

Процедура ЗаписьВJSON()  Экспорт
	ВызватьИсключение "Не реализовано!";
КонецПроцедуры
